# SSDLite with MobileDet-DSP feature extractor.
# Reference: Xiong & Liu et al., https://arxiv.org/abs/2004.14525
# Trained on COCO, initialized from scratch.
#
# 2.82B MulAdds, 7.16M Parameters. Latency is 12.3ms on Pixel 4 DSP.
# Achieves 28.9 mAP on COCO14 minival dataset.
# Achieves 28.4 mAP on COCO17 val dataset.
#
# This config is TPU compatible.

model {
  ssd {
    inplace_batchnorm_update: true
    freeze_batchnorm: false
    num_classes: 1
    num_embedding: 128
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
        use_matmul_gather: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    encode_background_as_zeros: true
    anchor_generator {
      ssd_anchor_generator {
        reduce_boxes_in_lowest_layer: false
        num_layers: 6
        scales: [0.02, 0.04, 0.06, 0.1, 0.21, 0.48]
        aspect_ratios: [0.17, 0.23, 0.33]
      }
    }
    image_resizer {
      fixed_shape_resizer {
        height: 300
        width: 300
      }
    }
    box_predictor {
      convolutional_box_predictor {
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: false
        dropout_keep_probability: 0.8
        kernel_size: 3
        use_depthwise: true
        box_code_size: 4
        apply_sigmoid_to_scores: false
        class_prediction_bias_init: -4.6
        conv_hyperparams {
          activation: RELU_6,
          regularizer {
            l2_regularizer {
              weight: 0.00004
            }
          }
          initializer {
            random_normal_initializer {
              stddev: 0.03
              mean: 0.0
            }
          }
          batch_norm {
            train: true,
            scale: true,
            center: true,
            decay: 0.97,
            epsilon: 0.001,
          }
        }
      }
    }
    feature_extractor {
      type: 'ssd_mobiledet_dsp'
      min_depth: 16
      depth_multiplier: 1.0
      use_depthwise: true
      conv_hyperparams {
        activation: RELU_6,
        regularizer {
          l2_regularizer {
            weight: 0.00004
          }
        }
        initializer {
          truncated_normal_initializer {
            stddev: 0.03
            mean: 0.0
          }
        }
        batch_norm {
          train: true,
          scale: true,
          center: true,
          decay: 0.97,
          epsilon: 0.001,
        }
      }
      override_base_feature_extractor_hyperparams: false
    }
    loss {
      classification_loss {
        weighted_sigmoid_focal {
          alpha: 0.75,
          gamma: 2.0
        }
      }
      localization_loss {
        weighted_ciou {
        }
      }
      embedding_classification_loss {
        weighted_softmax {
        }
      }
      classification_weight: 1.0
      localization_weight: 5.0
      embedding_classification_loss_weight: 1.0

      enable_task_independent_uncertainty_training: True
      trainable_weight_classification: -4.15
      trainable_weight_localization: -4.85
      trainable_weight_sub_classification: -1
      trainable_weight_embedding: -2.3
    }
    normalize_loss_by_num_matches: true
    normalize_loc_loss_by_codesize: true
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-8
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
        use_static_shapes: true
      }
      score_converter: SIGMOID
    }
  }
}

train_config: {
  fine_tune_checkpoint: "/tempssd/people_detection2/model_080622_track_ciou_base/model.ckpt-400000"
  fine_tune_checkpoint_type:  "detection"

  # we restore not only FeatureExtractor but also BoxPredictor. An then only train "BoxPredictor_.\/ClassPredictor.*".
  load_all_detection_checkpoint_vars: true
  # freeze_variables: ["FeatureExtractor.*", "BoxPredictor_.\/BoxEncoding.*"]

  batch_size: 16
  sync_replicas: false
  startup_delay_steps: 0
  replicas_to_aggregate: 1
  num_steps: 1
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  #data_augmentation_options {
  #  ssd_random_crop_fixed_aspect_ratio {
  #        operations {
  #          min_object_covered: 1.0
  #          min_area: 0.5
  #          max_area: 1.0
  #          overlap_thresh: 0.3
  #          random_coef: 0.15
  #        }
  #  }
  #}
  optimizer {
    momentum_optimizer: {
      learning_rate: {
        cosine_decay_learning_rate {
          learning_rate_base: 1e-2
          total_steps: 20000
          warmup_learning_rate: 5e-4
          warmup_steps: 1000
          hold_base_rate_steps: 0
          min_learning_rate: 1e-10
        }
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: false
  }
  max_number_of_boxes: 100
  unpad_groundtruth_tensors: false
}

train_input_reader: {
  label_map_path: "object_detection/data/oid_bbox_people_label_map.pbtxt"
  # track_group_id_lookup: "object_detection/dataset_tools/joint_detection_and_embedding/track_group_to_max_id_dict.json"
  # track_group_id_lookup: "object_detection/dataset_tools/joint_detection_and_embedding/track_group_to_max_id_dict_wo_cuhksysu.json"
  track_group_id_lookup: "object_detection/dataset_tools/joint_detection_and_embedding/track_group_to_max_id_dict_only_mot.json"
  load_track_id: true
  tf_record_input_reader {
    # input_path: "/tempssd/people_detection2/dataset/ETHZ/test*05*tfrecord*"
    input_path: ["/tempssd/people_detection2/dataset/MOT17/*tfrecord*"]
  }
  #    "/tempssd/people_detection2/dataset/ETHZ/*tfrecord*",
  #    "/tempssd/people_detection2/dataset/PRW/*tfrecord*",
  #    "/tempssd/people_detection2/dataset/Citypersons/*tfrecord*"
  #     "/tempssd/people_detection2/dataset/CUHK-SYSU/*tfrecord*"
  #     "/tempssd/people_detection2/dataset/Caltech/*tfrecord*",
}

eval_config: {
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
  num_examples: 8000
  skip_labels: True
}

eval_input_reader: {
  label_map_path: "object_detection/data/oid_bbox_people_label_map.pbtxt"
  # track_group_id_lookup: "object_detection/dataset_tools/joint_detection_and_embedding/track_group_to_max_id_dict.json"
  # track_group_id_lookup: "object_detection/dataset_tools/joint_detection_and_embedding/track_group_to_max_id_dict_wo_cuhksysu.json"
  track_group_id_lookup: "object_detection/dataset_tools/joint_detection_and_embedding/track_group_to_max_id_dict_only_mot.json"
  load_track_id: true
  shuffle: true
  num_epochs: 1
  tf_record_input_reader {
    # input_path: "/tempssd/people_detection2/dataset/validation/*.tfrecord-*"
    input_path: ["/tempssd/people_detection2/dataset/MOT17/*tfrecord*"]
    #, "/tempssd/people_detection2/dataset/PRW/*tfrecord*"
  }
}
